/* 웹 로그 정규 표현식 */

// ip 정규 표현식 (정상 작동)
const ip = /(?<![0-9])(?:(?:25[0-5]|2[0-4][0-9]|[0-1]?[0-9]{1,2})[.](?:25[0-5]|2[0-4][0-9]|[0-1]?[0-9]{1,2})[.](?:25[0-5]|2[0-4][0-9]|[0-1]?[0-9]{1,2})[.](?:25[0-5]|2[0-4][0-9]|[0-1]?[0-9]{1,2}))(?![0-9])/g;
//url 정규 표현식 (정상 작동)
const url = /(http|https):\/\/(\w+:{0,1}\w*@)?(\S+)(:[0-9]+)?(\/|\/([\w#!:.?+=&%@!\-\/]))?/g;
//날짜 정규 표현식 (정상 작동)
const date= /\[([\w:/]+\s[+\-]\d{4})\]/g;
//메소드 정규 표현식 (정상 작동)
const method = /GET|POST|PUT|DELETE/g


exports.regex = {
    webIp : ip,
    webUrl: url,
    webDate: date,
    webMethod: method,
};